print("доброго дня,расскажу о себе") # синтаксический ввод

my_age = 17                                                                # int (целочисленный тип)
my_name = "Кристина"                                                      # str (строковый тип)
my_location = "Великий Новгород."                                          # str (строковый тип)
foreword = "пожалуй начнём :"                              # str (строковый тип)
print(foreword)

print("Меня зовут", my_name, "мне", my_age, "лет.")                        # конкатинация строк
print("сейчас я проживаю и учусь в городе -", my_location)

time_before_college = 15                                                   # int (целочисленный тип)
my_place_of_study = "Новгородский строительный колледж,проще говоря шарга."                                                 # str (строковый тип)
print("До моего колледжа ехать минут", time_before_college,"- учусь в", my_place_of_study) # конкатинация строк
print("с программированием у меня всё туго,наверное потому что мне это не особо и интересно, да и я в принципе мало что понимаю, скорее всего в конце года буду переводиться на другую специальность")
print("Но всё же обо мне:")

my_weight = 54                                                           # float (тип с точкой)
my_height = 158                                                            # int (целочисленный тип)
print("я низенькая,всего", my_height,)
print("да и вешу не прям уж много", my_weight)

your_name = "Владислав!"                                                   # str (строковый тип)
true = "правда"                                                            # str (строковый тип)

print("могу сказать лишь одно, спасибо, что терпите нас", true, "это многого стоит,", your_name) # конкатинация строк

